
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтоПоменялось = "Цена";
	
	РассчитатьСумму(ТекущиеДанные, ЧтоПоменялось);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтоПоменялось = "Количество";
	
	РассчитатьСумму(ТекущиеДанные, ЧтоПоменялось);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму(Строка, ТекстСообщения)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщить(ТекстСообщения);
	
	ПОльзователь = ОписаниеЧеловека();
	Сообщить(Пользователь.Имя);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", "Антон");
	Описание.Вставить("Дата", ТекущаяДата());
	Описание.Вставить("Уволен", Ложь);
	Описание.Вставить("Стаж", 14);
	Возврат Описание;
		
КонецФункции

#КонецОбласти